-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-11-14 12:31:01
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.3.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `group_c_db`
--

-- --------------------------------------------------------

--
-- 資料表結構 `my_order`
--

CREATE TABLE `my_order` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `order_state` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `order_name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `total_amount` int(11) NOT NULL,
  `subtotal_price` int(11) NOT NULL,
  `shipping` int(11) NOT NULL,
  `beastie_coin` int(11) NOT NULL,
  `tableware` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `total_price` int(11) NOT NULL,
  `take_date` date NOT NULL,
  `take_time` varchar(225) COLLATE utf8_unicode_ci NOT NULL,
  `take_way` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `take_county` varchar(225) COLLATE utf8_unicode_ci NOT NULL,
  `take_district` varchar(225) COLLATE utf8_unicode_ci NOT NULL,
  `take_address` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `take_person` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `mobile` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `receipt` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `my_order`
--

INSERT INTO `my_order` (`sid`, `member_sid`, `order_state`, `order_name`, `total_amount`, `subtotal_price`, `shipping`, `beastie_coin`, `tableware`, `total_price`, `take_date`, `take_time`, `take_way`, `take_county`, `take_district`, `take_address`, `take_person`, `mobile`, `receipt`, `created_at`) VALUES
(1, 1, '揪團中', '煞氣@C小隊', 2, 300, 50, 0, '', 350, '2020-11-14', '11:00 ~ 11:30', '自取', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:33:38'),
(2, 1, '火速運送中', '', 20, 3270, 0, 0, '', 3270, '2020-11-14', '11:00 ~ 11:30', '自取', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:34:01'),
(3, 1, '火速運送中', '', 10, 1625, 0, 0, '', 1625, '2020-11-14', '11:00 ~ 11:30', '自取', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:34:51'),
(4, 1, '已送達', '', 6, 1045, 0, 0, 'no', 1045, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:50:53'),
(5, 1, '未送達', '', 9, 1550, 0, 0, 'yes', 1550, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:51:16'),
(6, 1, '火速運送中', '', 12, 1905, 0, 0, 'no', 1905, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:53:25'),
(7, 1, '揪團中', 'C組好棒棒', 30, 5145, 0, 0, '', 5145, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:53:38'),
(8, 1, '已送達', '', 2, 260, 50, 0, 'yes', 310, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:53:47'),
(9, 1, '未送達', '', 6, 1045, 0, 0, 'no', 1045, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:53:55'),
(10, 1, '未送達', '', 4, 540, 0, 0, '', 540, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:54:24'),
(11, 1, '火速運送中', '', 10, 1625, 0, 0, 'no', 1625, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 02:59:48'),
(12, 1, '未送達', '', 2, 280, 50, 0, 'yes', 330, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:00:00'),
(13, 1, '已送達', '', 5, 670, 0, 0, 'yes', 670, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:00:19'),
(14, 1, '已退費', '', 9, 1455, 0, 0, '', 1455, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:00:25'),
(15, 1, '火速運送中', '', 12, 2025, 0, 0, 'yes', 2025, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:00:42'),
(16, 1, '已退費', '', 11, 1430, 0, 0, '', 1430, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:01:04'),
(17, 1, '已退費', '', 9, 1495, 0, 0, 'yes', 1495, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:01:10'),
(18, 1, '火速運送中', '', 15, 2475, 0, 0, '', 2475, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:01:17'),
(19, 1, '已退費', '', 5, 730, 0, 0, '', 730, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:01:44'),
(20, 1, '已送達', '', 21, 3400, 0, 0, '', 3400, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:01:59'),
(21, 1, '火速運送中', '', 13, 2015, 0, 0, '', 2015, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:07:14'),
(22, 1, '未送達', '', 9, 1495, 0, 0, 'yes', 1495, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:12:44'),
(23, 1, '未送達', '', 5, 730, 0, 0, '', 730, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:15:09'),
(24, 1, '已退費', '', 9, 1455, 0, 0, 'yes', 1455, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:17:40'),
(25, 1, '未送達', '', 9, 1455, 0, 0, '', 1455, '2020-11-14', '11:00 ~ 11:30', '1', '台北市', '大安區', '忠孝東路一段50號', '林凱特', '0910123456', '', '2020-11-14 03:18:11');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `my_order`
--
ALTER TABLE `my_order`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `my_order`
--
ALTER TABLE `my_order`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
